{
  "data": [
    {
      "id": 1,
      "imgurl": "https://ooozydejaggapckmuidd.supabase.co/storage/v1/object/public/spanish-storage-bucket//promaket.png",
      "title": "ProMarket",
      "description": "Zorra is an e-commerce platform dedicated to delivering high-quality products with a seamless shopping experience. Built with user convenience in mind, Zorra offers a wide range of items, intuitive navigation, and secure checkout, empowering customers to shop confidently and efficiently.",
      "stack": "REACTJS, TAILWIND, TYPESCRIPT, NODEJS, FIREBASE, POSTGRESQL",
      "link": "https://promaketlinksandservices.ng/"
    },
    {
      "id": 2,
      "imgurl": "https://ooozydejaggapckmuidd.supabase.co/storage/v1/object/public/spanish-storage-bucket//virall.png",
      "title": "Virall",
      "description": "Virall is a digital agency specializing in crafting innovative web solutions and digital strategies for businesses. From eye-catching website designs to tailored marketing campaigns, Virall helps brands establish a powerful online presence and achieve their digital goals with precision and creativity.",
      "stack": "REACTJS, TAILWIND, EXPRESS, MONGODB",
      "link": "https://virall.netlify.app/"
    },
    {
      "id": 3,
      "imgurl": "https://ooozydejaggapckmuidd.supabase.co/storage/v1/object/public/spanish-storage-bucket//turban.png",
      "title": "Turban",
      "description": "An Eccomerce Website Where buyers can meet sellers and negotiate price and place orders. The project is still ongoing and its open sourced.  It's features involve user authetications, monthly newsletter, Shoping Cart, Crud Requests e.t.c",
      "stack": "REACTJS, SCSS, NODEJS, MONGODB",
      "link": "https://startup-ochre-kappa.vercel.app/"
    },
    {
      "id": 4,
      "imgurl": "https://ooozydejaggapckmuidd.supabase.co/storage/v1/object/public/spanish-storage-bucket//theevent.png",
      "title": "The Event",
      "description": "An Eccomerce Website Where buyers can meet sellers and negotiate price and place orders. The project is still ongoing and its open sourced. <br /> It's features involve user authetications, monthly newsletter, Shoping Cart, Crud Requests e.t.c",
      "stack": "REACTJS, SCSS, NODEJS, MONGODB",
      "link": "https://theevent-flax.vercel.app/"
    },
    {
      "id": 5,
      "imgurl": "https://ooozydejaggapckmuidd.supabase.co/storage/v1/object/public/spanish-storage-bucket//spanish.png",
      "title": "Spanish Hotel",
      "description": "Spanish Hotel is a full-featured hotel management platform built for ease of reservations, room management, and customer interaction. Users can view room types, make online bookings, and receive real-time updates. The backend supports automated room status tracking, admin tools, and dynamic pricing controls. Designed with responsiveness and accessibility in mind.",
      "stack": "NEXTJS, TAILWINDCSS, SHADCN UI, POSTGRESQL PRISMA, SUPABSE",
      "link": "https://spanishhotel.ng/"
    }
  ],

  "skill": [
    {
      "id": 1,
      "imgurl": "https://ooozydejaggapckmuidd.supabase.co/storage/v1/object/public/spanish-storage-bucket//html.png",
      "title": "Frontend Development",
      "description": "My approach to frontend development combines creativity with precision. Using HTML to structure content, I ensure semantic and accessible layouts that form the foundation of responsive web experiences. With CSS and Sass, I design sleek interfaces that are both visually engaging and performance-optimized. JavaScript allows me to introduce dynamic behavior and interactivity, bringing websites to life. I use React to build fast, component-based interfaces that scale efficiently and deliver a smooth user experience. For complex applications, I integrate frameworks like Next.js to enable server-side rendering and SEO-friendly architecture. I also harness reusable UI components and hooks to accelerate development and reduce code duplication. Each project I handle is designed mobile-first, ensuring seamless performance across all devices. Whether it’s building marketing sites or full-fledged web apps, I bring an eye for detail and a strong understanding of user needs to every frontend I build.",
      "icons": [
        "DiHtml5",
        "DiCss3",
        "DiSass",
        "DiJsBadge",
        "DiReact",
        "DiNodejsSmall",
        "DiNextjs"
      ]
    },
    {
      "id": 2,
      "imgurl": "https://ooozydejaggapckmuidd.supabase.co/storage/v1/object/public/spanish-storage-bucket//css.png",
      "title": "Backend Development",
      "description": "In backend development, I architect the logic that powers high-performance web applications. I use Node.js as the backbone of my server-side code, ensuring event-driven, scalable APIs. Express.js helps me manage routes, middleware, and error handling with clean, modular code structures. I handle data efficiently using MongoDB, PostgreSQL, or MySQL, depending on project needs, and apply ORMs like Prisma for clean data querying and schema migration. For authentication and user sessions, I implement secure JWT-based systems and Firebase when real-time sync or serverless backend is required. My backend workflow ensures robust error handling, high-level security, and clean documentation. I focus on RESTful design principles and can also implement GraphQL when needed. From processing form data to enabling AI-driven features or payment integrations, I make sure the backend is reliable, scalable, and easy to maintain. Every backend I build is designed to work in harmony with the frontend for a smooth user experience.",
      "icons": [
        "DiNodejsSmall",
        "DiExpress",
        "DiMongodb",
        "DiPostgresql",
        "DiMysql",
        "DiFirebase",
        "DiPrisma"
      ]
    },
    {
      "id": 3,
      "imgurl": "https://ooozydejaggapckmuidd.supabase.co/storage/v1/object/public/spanish-storage-bucket//javascript.png",
      "title": "Web & Graphic Design",
      "description": "My approach to web and graphic design blends creativity with functionality. Using tools like Figma, Adobe XD, and Canva, I create intuitive interfaces that align with the brand’s identity while ensuring excellent user experience. I begin with wireframes and mood boards to explore ideas, then iterate on layouts, color palettes, and typography to bring concepts to life. For logos, social media posts, and brand visuals, I rely on Adobe Illustrator and Photoshop to craft sharp, high-resolution designs that capture attention. I understand the balance between aesthetic design and functional UX, making sure every design element serves a purpose. My designs are mobile-friendly, accessibility-conscious, and created with developers in mind—ensuring smooth handoffs for implementation. Whether I’m prototyping a landing page or creating brand assets, I focus on delivering cohesive, visually striking outputs that help businesses communicate clearly, build trust, and convert users effectively across all platforms.",
      "icons": [
        "DiFigma",
        "DiAdobeXd",
        "DiSketch",
        "DiInvision",
        "DiCanva",
        "DiPhotoshop",
        "DiIllustrator"
      ]
    }
  ]
}
